IDENTIFICATION DIVISION.
PROGRAM-ID. BALANCEMODULE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ACCOUNT-FILE ASSIGN TO "CONTIDB.DAT"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  ACCOUNT-FILE.
COPY "ACCOUNT-STRUCTURE.CPY".

LINKAGE SECTION.
01  LNK-COMMAREA.
    05  LNK-ACCOUNT-NUMBER      PIC X(10).
    05  LNK-NEW-BALANCE         PIC S9(7)V99.

PROCEDURE DIVISION USING LNK-COMMAREA.

    OPEN INPUT ACCOUNT-FILE
    PERFORM FIND-ACCOUNT
    CLOSE ACCOUNT-FILE

    MOVE ACCOUNT-BALANCE TO LNK-NEW-BALANCE.

    EXIT PROGRAM.

    FIND-ACCOUNT.
        READ ACCOUNT-FILE
            AT END DISPLAY "Conto non trovato."
        END-READ.

        IF ACCOUNT-NUMBER = LNK-ACCOUNT-NUMBER
            CONTINUE
        ELSE
            PERFORM FIND-ACCOUNT
        END-IF.
